---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailIndex.LeftPrimary
enum: Autodesk.Revit.DB.Architecture.RailIndex
source: html/c743a6e2-aedc-7320-55b2-bbc8624ec606.htm
---
# Autodesk.Revit.DB.Architecture.RailIndex.LeftPrimary

The rail is a primary rail on the left.